recursion-practice-using-first-and-rest-solutions.org
#+TITLE: Recursion Practice using first and rest (Solutions)
#+PROPERTY: header-args :results  output  :noweb yes :exports both    
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup  

* How To 

 - Create a file with extension .js 
 - Copy a code snippet to the file and then execute in the command line:  

#+begin_src sh
node filename.js 
#+end_src

* first and rest
  Using the destructuring assignment syntax we can get the "first element of an array" 
and "the rest of the array". I think that using "first and rest" makes it easier to think 
recursively. 


#+begin_src js
let arr = [1,2,3,4]
const [first, ...rest] = arr;

console.log('first: ', first);
console.log('rest:  ', rest);
#+end_src

#+RESULTS:
: first:  1
: rest:   [ 2, 3, 4 ]

* check
  The check function is only a wrapper for assert (Node.js). I wrote it to make  more readable
the tests and outputs.


#+NAME: check 
#+begin_src js :tangle ./check.js 
'use strict';
const assert = require("assert");
function check(message) {
  return  { 
   fn(fnToCheck) { 
      return  {
          toBe: {
            msg   :  message != undefined ? message :  '',
            actual: fnToCheck,
            fnExeAssert(fnAssert,actual, expected) {
              try {
                  fnAssert(actual, expected);
                  console.log('PASS:   ' + this.msg + '\n' );
               } catch(e) {
                  console.log('FAIL:   ' + this.msg );
                  console.log('        expected: ',   e.expected,
                              '\n        actual:   ', e.actual,  '\n');
               }
            },
           deepStrictEqual (expected)  {
              this.fnExeAssert(assert.deepStrictEqual, this.actual, expected)
            },
           strictEqual (expected)  {
              this.fnExeAssert(assert.strictEqual, this.actual, expected)
           }
       } 
      } 
    } 
  }  
}
#+end_src

