recursion-practice-using-first-and-rest-solutions.org
* remove first ocurrence

#+begin_quote
Write a function that removes the first occurrence of an number m from an array of numbers.\\ 
If m does not occur in the array, the array remains unchanged.
#+end_quote

#+NAME: removeFirstOcurrence
#+begin_src js 
<<check>> 

check("removeFirstOcurrence(5, []) should return an empty array")
  .fn(removeFirstOcurrence(5, []))
  .toBe
  .deepStrictEqual([]);

check("removeFirstOcurrence(5, [5]) should return an empty array")
  .fn(removeFirstOcurrence(5, [5]))
  .toBe
  .deepStrictEqual([]); 

check("removeFirstOcurrence(5, [1]) should return the original array without changes")
  .fn(removeFirstOcurrence(5, [1]))
  .toBe
  .deepStrictEqual([1]);

check("removeFirstOcurrence(5, [5,5]) should return an array with only one 5")
  .fn(removeFirstOcurrence(5, [5,5]))
  .toBe
  .deepStrictEqual([5]); 

check("removeFirstOcurrence(5, [1,5,5,2,3]) should return an array without the first ocurrence of 5")
  .fn(removeFirstOcurrence(5, [1,5,5,2,3]))
  .toBe
  .deepStrictEqual([1,5,2,3]);

check( "removeFirstOcurrence(5, [5,1,2,3]) should return an array without 5")
  .fn(removeFirstOcurrence(5, [5,1,2,3]))
  .toBe
  .deepStrictEqual([1,2,3]);

check("removeFirstOcurrence(5, [1,2,5,3]) should return an array without 5")
  .fn(removeFirstOcurrence(5, [1,2,5,3]))
  .toBe
  .deepStrictEqual([1,2,3]);

check("removeFirstOcurrence(5, [1,2,3,5]) should return an array without 5")
  .fn(removeFirstOcurrence(5, [1,2,3,5]))
  .toBe
  .deepStrictEqual([1,2,3]);


/**
 * Removes the first occurrence of an number m from an array of numbers. 
 * If m does not occur in the array, the array remains unchanged.
 * @param   {number} m   - the number to remove
 * @param   {array}  arr - the array of numbers 
 * @returns {array}      - the array without the first ocurrence of m or the original array 
 */
function removeFirstOcurrence(m, arr) {
   if(arr.length === 0 ) return [] 
   const [first, ...rest] = arr;
   
   if(m === first) {
    return rest;
   } else {
    let a =  removeFirstOcurrence(m, rest);
    a.unshift(first);
    return a;
   }
}
#+end_src

#+RESULTS: removeFirstOcurrence
#+begin_example
PASS:   removeFirstOcurrence(5, []) should return an empty array

PASS:   removeFirstOcurrence(5, [5]) should return an empty array

PASS:   removeFirstOcurrence(5, [1]) should return the original array without changes

PASS:   removeFirstOcurrence(5, [5,5]) should return an array with only one 5

PASS:   removeFirstOcurrence(5, [1,5,5,2,3]) should return an array without the first ocurrence of 5

PASS:   removeFirstOcurrence(5, [5,1,2,3]) should return an array without 5

PASS:   removeFirstOcurrence(5, [1,2,5,3]) should return an array without 5

PASS:   removeFirstOcurrence(5, [1,2,3,5]) should return an array without 5

#+end_example

