recursion-practice-using-first-and-rest-solutions.html

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, []) should return an empty array"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, []<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [5]) should return an empty array"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [5]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[]<span style="color: #c678dd; font-weight: bold;">)</span>; 

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1]) should return the original array without changes"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [5,5]) should return an array with only one 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [5,5]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[5]<span style="color: #c678dd; font-weight: bold;">)</span>; 

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1,5,5,2,3]) should return an array without the first ocurrence of 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1,5,5,2,3]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,5,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span> <span style="color: #98be65;">"removeFirstOcurrence(5, [5,1,2,3]) should return an array without 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [5,1,2,3]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1,2,5,3]) should return an array without 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1,2,5,3]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1,2,3,5]) should return an array without 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1,2,3,5]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;


<span style="color: #9eac8c;">/**</span>
<span style="color: #9eac8c;"> * Removes the first occurrence of an number m from an array of numbers. </span>
<span style="color: #9eac8c;"> * If m does not occur in the array, the array remains unchanged.</span>
<span style="color: #9eac8c;"> * @param   {number} m   - the number to remove</span>
<span style="color: #9eac8c;"> * @param   {array}  arr - the array of numbers </span>
<span style="color: #9eac8c;"> * @returns {array}      - the array without the first ocurrence of m or the original array </span>
<span style="color: #9eac8c;"> */</span>
<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">removeFirstOcurrence</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #61afef;">m</span>, <span style="color: #61afef;">arr</span><span style="color: #c678dd; font-weight: bold;">)</span> <span style="color: #c678dd; font-weight: bold;">{</span>
   <span style="color: #c678dd; font-weight: bold;">if(</span>arr.length === 0 <span style="color: #c678dd; font-weight: bold;">)</span> <span style="color: #c678dd; font-weight: bold;">return</span> [] 
   <span style="color: #c678dd; font-weight: bold;">const</span> [first, ...rest] = arr;

   <span style="color: #c678dd; font-weight: bold;">if(</span>m === first<span style="color: #c678dd; font-weight: bold;">)</span> <span style="color: #c678dd; font-weight: bold;">{</span>
    <span style="color: #c678dd; font-weight: bold;">return</span> rest;
   <span style="color: #c678dd; font-weight: bold;">}</span> <span style="color: #c678dd; font-weight: bold;">else</span> <span style="color: #c678dd; font-weight: bold;">{</span>
    <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">a</span> =  removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>m, rest<span style="color: #c678dd; font-weight: bold;">)</span>;
    a.unshift<span style="color: #c678dd; font-weight: bold;">(</span>first<span style="color: #c678dd; font-weight: bold;">)</span>;
    <span style="color: #c678dd; font-weight: bold;">return</span> a;
   <span style="color: #c678dd; font-weight: bold;">}</span>
<span style="color: #c678dd; font-weight: bold;">}</span>
</pre>
</div>

<pre class="example">
PASS:   removeFirstOcurrence(5, []) should return an empty array

PASS:   removeFirstOcurrence(5, [5]) should return an empty array

PASS:   removeFirstOcurrence(5, [1]) should return the original array without changes

PASS:   removeFirstOcurrence(5, [5,5]) should return an array with only one 5

PASS:   removeFirstOcurrence(5, [1,5,5,2,3]) should return an array without the first ocurrence of 5

PASS:   removeFirstOcurrence(5, [5,1,2,3]) should return an array without 5

PASS:   removeFirstOcurrence(5, [1,2,5,3]) should return an array without 5

PASS:   removeFirstOcurrence(5, [1,2,3,5]) should return an array without 5

</pre>
</div>
</div>
