recursion-practice-using-first-and-rest-solutions.org
* sum

#+begin_quote
Write a function that sums every number in the array.\\ 
If the array is empty, return 0.
#+end_quote
  
#+begin_src js
<<check>> 

check("sum([0] should return 0")
  .fn(sum([0]))
  .toBe
  .strictEqual(0);

check("sum([1] should return 1")
  .fn(sum([1]))
  .toBe
  .strictEqual(1);

check("sum([0,1] should return 1")
  .fn(sum([0,1]))
  .toBe
  .strictEqual(1);

check("sum([1,2] should return 3")
  .fn(sum([1,2]))
  .toBe
  .strictEqual(3);

check("sum([1,-1] should return 0")
  .fn(sum([1,-1]))
  .toBe
  .strictEqual(0);

/**
 * Returns the sum of every number in the array 
 * If the array is empty, return 0;
 * @param {array}  arr  - the array  of numbers
 * @returns {number}    - the sum of every number in the array or zero 
 */
function sum(arr) {
 if(arr.length === 0) return 0;
 const [first, ...rest] = arr; 
 return first + sum(rest);
}
#+END_src

#+RESULTS:
#+begin_example
PASS:   sum([0] should return 0

PASS:   sum([1] should return 1

PASS:   sum([0,1] should return 1

PASS:   sum([1,2] should return 3

PASS:   sum([1,-1] should return 0

#+end_example

