recursion-practice-using-first-and-rest-solutions.org
* countChar 

#+begin_quote
Write a function that counts the ocurrences of a character in a string.\\
If the character  does not occur in the string return 0. 
#+end_quote


#+begin_src js
<<check>>

check("countChar('h', 'ayzayzzz') should return 0")
  .fn(countChar('h',  'ayzayzzz')).toBe.strictEqual(0);

check("countChar('a', 'ayzayzzz') should return 2")
  .fn(countChar('a',  'ayzayzzz')).toBe.strictEqual(2);

check("countChar('y', 'ayzayzzz') should return 2")
  .fn(countChar('y',  'ayzayzzz')).toBe.strictEqual(2);

check("countChar('z', 'ayzayzzz') should return 4")
  .fn(countChar('z',  'ayzayzzz')).toBe.strictEqual(4);

/**
 * Returns the number of ocurrences of a character in a string.  
 * If the character  does not occur in the string return 0. 
 * @param   {string}       c   - the character to count
 * @param   {string|array} str - string in the first call, array in the recursive calls 
 * @returns {number}       the number of ocurrences of the character in the string  or zero
 */
function countChar(c, str) {
 if(str.length === 0 ) return 0 
 const [first, ...rest]  = str;

 return (c === first ) ? 1 + countChar(c, rest) : countChar(c, rest)  
}

#+end_src

#+RESULTS:
: PASS:   countChar('h', 'ayzayzzz') should return 0
: 
: PASS:   countChar('a', 'ayzayzzz') should return 2
: 
: PASS:   countChar('y', 'ayzayzzz') should return 2
: 
: PASS:   countChar('z', 'ayzayzzz') should return 4
: 

 

