recursion-practice-using-first-and-rest-solutions.org
* len

#+begin_quote
Write a function that returns the number of elements in an array.\\
If the array is empty, return 0.
#+end_quote


#+begin_src js 
<<check>>

check("len([]) should return 0")
  .fn(len([]))
  .toBe
  .strictEqual(0)

check("len([0]) should return 1")
  .fn(len([0]))
  .toBe
  .strictEqual(1)

check("len([1,2]) should return 2")
  .fn(len([1,2]))
  .toBe
  .strictEqual(2)


/**
 * Returns the number of elements in an array.
 * If the array is empty, return 0.
 * @param {arr} arr  - the array 
 * @returns {number} - the number of elements in the array or zero
 */

function len(arr){ 
 if(arr.length === 0) return 0;  
 const [first, ...rest]  = arr;
 return 1 + len(rest);
}
#+end_src

#+RESULTS:
: PASS:   len([]) should return 0
: 
: PASS:   len([0]) should return 1
: 
: PASS:   len([1,2]) should return 2
: 

