recursion-practice-using-first-and-rest-solutions.org
* max

#+begin_quote
Write a function that returns the largest number of an  array of numbers.\\
If the array is empty, returns 0;
#+end_quote

#+begin_src js 
<<check>>

check("max[15,8,3,9] should return 15")
  .fn(max([15,8,3,9]))
  .toBe
  .strictEqual(15)

check("max[8,15,9] should return 15")
  .fn(max([8,15,9]))
  .toBe
  .strictEqual(15)

check("max[8,9,15] should return 15")
  .fn(max([8,9,15]))
  .toBe
  .strictEqual(15)

check("max[14,16, 8,3,9,14] should return 16")
  .fn(max([14,16, 8,3,9,14]))
  .toBe
  .strictEqual(16)

/**
 * Return the largest number of an  array of numbers.
 * If the array is empty, returns 0;
 * @param   {array}  arr - the array of numbers
 * @returns {number}     - the larget number in the array or 0 
 */
function max(arr) {
  if(arr.length === 1 ) { 
    return arr[0];
  } else {
    const [first, ...rest] = arr;
    if (first > rest[0])  {
       rest.shift();
       rest.push(first)
       return max(rest)  
     } else {
       return max(rest)  
     }
  }
}
#+end_src

#+RESULTS:
: PASS:   max[15,8,3,9] should return 15
: 
: PASS:   max[8,15,9] should return 15
: 
: PASS:   max[8,9,15] should return 15
: 
: PASS:   max[14,16, 8,3,9,14] should return 16
: 



